Repository: DmytroProg/Chess_Project
Catalog: Chess/Strings.*.resx
Languages: uk

source: Bishop
uk: Офіцер

# BishopContent
source: The bishop can move diagonally like a queen, but not forward, backward, or sideways. Each side starts with two bishops, one on a light square and one on a dark square.
uk: Офіцер може рухатися по діагоналі, як королева, але не вперед, назад або вбік. Кожна сторона починається з двох офіцерів, один на світлому полі, а інший на темному полі.

# BlackWin
source: Black player won!
uk: Чорні перемогли!

source: Continue
uk: Продовжити

source: Draw
uk: Нічия

source: King
uk: Король

# KingContent
source: Chess is won by checkmating - trapping - the opponent’s king. The king can move to any square that’s directly next to it: up, down, sideways, or diagonal.
uk: Шахи виграють шляхом постановки шахів - пастки - королю супротивника. Король може рухатися на будь-яке поле, яке знаходиться безпосередньо поруч з ним: вгору, вниз, убік або по діагоналі.

source: Knight
uk: Кінь

# KnightContent
source: The knight is the only chess piece that doesn't go in a straight line. The knight moves two squares in one direction and then turns and goes one square to the side.
uk: Кінь — єдина шахова фігура, яка не йде по прямій лінії. Кінь рухається на дві клітинки в одному напрямку, а потім повертається і йде на одну клітинку вбік.

# Minutes
source: mins
uk: хв

source: Pawn
uk: Пішак

# PawnContent
source: Pawns move one square forward and cannot move back. A pawn may advance two squares on its first move. Pawns can only capture one square diagonally ahead.
uk: Пішаки рухаються на одне поле вперед і не можуть рухатися назад. Пішак може просунутися на два поля за свій перший хід. Пішаки можуть захопити лише одне поле по діагоналі попереду.

source: Pawn Promotion
uk: Перетворення пішака

source: Play
uk: Грати

# PPContent
source: When a pawn reaches the end of the board it “promotes”, it turns into another piece. Most of the time players promote to a queen, but a rook, knight, or bishop is also possible.
uk: Коли пішак досягає кінця дошки, він «просувається», перетворюється на іншу фігуру. У більшості випадків гравці підвищуються до ферзя, але тура, конь або слон також можливі.

source: Queen
uk: Королева

# QueenContent
source: The queen can move forwards, backward, sideways, and diagonally like a king. However, unlike the king, the queen can move as far as it wants to in each of these directions.
uk: Королева може рухатися вперед, назад, убік і по діагоналі, як король. Однак, на відміну від короля, королева може рухатися скільки завгодно в кожному з цих напрямків.

source: Read rules
uk: Читати правила

# RulesHeader
source: RULES
uk: ПРАВИЛА

# Tower
source: Rook
uk: Тура

# TowerContent
source: The rook can move forwards, backward, and sideways.
uk: Тура може рухатися вперед, назад і вбік.

# WhiteWin
source: White player won!
uk: Білі перемогли!
